# починається з ключового слова if(якщо) за яким іде умова(якщо в мене є 50 грн то я куплю молоко)

# після умови ставиться двокрапка і з нового рядка з відступом йде блок інструкцій які будуть
# виконані якщо умова виконується

# після блоку if може бути нуль або більше блоків elif, інтерпретатор послідовно буде виконувати всі
# умови elif зверху вниз поки не знайде те яке виконається

# після може бути один блок else, який виконається якщо всі попередні умови не виконуються

a = int(input('Введіть число: '))
# коли а строго більше 0, тобто а повинно бути додатнім числом
if a > 0:  # Якщо правда то виконуй
    print('Число додатнє')
elif a < 0:
    # коли а строго менше 0, тобто а повинно бути від'ємним числом
    print("Число від'ємне")
else:
    print('Це число 0')
