# Написати два цикли. В першому циклі while ми постійно запрашуємо ціле число і в другому за допомогою
# циклу for рахуємо суму парних чисел від 0 до введеного числа. Вихід з першого циклу робимо, якщо
# ввели число 0

# Тести для нашої задачі:

# 10, 13, 73, 0 -> 1404
# 1, 2, 3, 4, 0 -> 10

sum = 0
while True:
    num = int(input('Enter integer (0 for output): '))
    if num == 0:
        break
    for i in range(num + 1):  # range(10 + 1) -> 0,1,2,3,4,5,6,7,8,9,10   '0123456789'
        if i % 2 == 0:
            sum += i  # i = 2, i = 4, i = 6,
        else:
            continue

print(sum)
